{
  "architectures": [
    "OpenBT5ForConditionalGeneration"
  ],
  "add_qkv_bias": true,
  "add_ffn_bias": false,
  "add_lm_head_bias": true,
  "attention_dropout": 0.1,
  "decoder_max_seq_length": 512,
  "decoder_start_token_id": 0,
  "eos_token_id": 1,
  "ffn_hidden_size": 16384,
  "hidden_dropout": 0.1,
  "hidden_size": 4096,
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "kv_channels": 128,
  "max_seq_length": 1024,
  "model_type": "OpenBT5",
  "num_decoder_layers": 36,
  "num_heads": 40,
  "num_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": false,
  "tokenizer_class": "OpenBT5Tokenizer",
  "transformers_version": "4.30.2",
  "vocab_size": 250368,
  "use_cache": true
}
